{
  "name": "Nyaomaru",
  "experience": "Frontend engineer with over 7 years of experience, proficient in Vue, React, and TypeScript.",
  "location": "Based in Saga Prefecture, Japan.",
  "specialty": "OSS development, library design, storytelling, and writing technical articles.",
  "language": "Japanese, English, and a little bit of Dutch.",
  "fun": "Growing radish, creative works and traveling around the world.",
  "traveled": "Visited 10 countries. These are the Netherlands, UK, Portugal, Sweden, Germany, Belgium, Malaysia, Singapore, Indonesia and the United States.",
  "OSS": "Contributed to Drupal and Quasar(At my legacy account) and more.",
  "Library": "I created Divider. I want to create more libraries in the future.",
  "who": "Nyaomaru is a cat. He's a frontend engineer who loves React and Vue.",
  "wife": "He has a wife. She is also cat and she is an artist.",
  "where": "Nyaomaru lives in Saga, Japan. He works fully remotely.",
  "how-long": "Nyaomaru has worked as a software engineer for over 7 years, mainly focusing on frontend.",
  "favorite": "React, Vue, growing radishes!",
  "work-style": "Fully remote, flexible hours, and a focus on work-life balance.",
  "live": "With his wife and a small fuzzy dog.",
  "Specialty": "Basketball, and read novels over 500 books.",
  "Good at": "Creating libraries, writing technical articles, and sharing knowledge.",
  "favorite author": "Ooe Kenzaburo, a Nobel Prize-winning author.",
  "backend": "Java(Spring Boot), PHP(Drupal), Python, and a little bit of Swift and Kotlin.",
  "tech_stack": [
    "Vue",
    "React",
    "TypeScript",
    "Node.js",
    "Vite",
    "Next",
    "Nuxt",
    "Remix",
    "TailwindCSS"
  ],
  "favorite tech": "Vue and React, with a strong preference for TypeScript. And I'm interested in Deno and Rust",
  "favorite OSS": "Zod, Tanstack, and ollama",
  "philosophy": "Simple is best. I believe in the power of simplicity in design and development.",
  "hobbies": [
    "Reading novels",
    "Watching sumo",
    "Playing basketball",
    "Growing radishes",
    "Creating art"
  ],
  "partner": "His wife is an artist cat who prefers shadows over spotlight. Nyaomaru loves to support her creative journey.",
  "life motto": "Live simply, love deeply, and create passionately.",
  "design": "Clean, minimalistic, and user-friendly designs that enhance the user experience.",
  "favorite design": "Feature-based design that focuses on functionality and user needs.",
  "favorite book": "The Pinch Runner Memorandum / The Game of Contemporaneity by Ooe Kenzaburo",
  "work experience": "Worked at various companies, including a startup and a large corporation, focusing on frontend development over seven years.",
  "mail": "nyaonyao0725@gmail.com",
  "help": "What can I help you with? If you confused how to ask me, please type 'commands'.",
  "commands": "who, contact, skills, hobbies, work, design, philosophy, life, partner, favorite, help",
  "contact": "You can contact me via email at nyaonyao0725@gmail.com"
}
